Revit 2024 API
BendingDetailCustomFieldProperties.AreEqualTo Method
 Identifies if the custom field properties are equal or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public virtual bool AreEqualTo(
	ICustomFieldProperties otherProperties
)
Visual Basic
Public Overridable Function AreEqualTo ( _
	otherProperties As ICustomFieldProperties _
) As Boolean
Visual C++
public:
virtual bool AreEqualTo(
	ICustomFieldProperties^ otherProperties
)
Parameters
otherProperties
Type: Autodesk.Revit.DB.ICustomFieldProperties
 The other properties.
Return Value
 Returns true if the custom field properties are equal, false otherwise.
Implements
ICustomFieldProperties.AreEqualTo(ICustomFieldProperties)
See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace